"""
День 1. Неделя 11. 3 января
Тема: Введение в Django Rest Framework. Теория

Если все эти системы, которые запрашиваюь данные с главного приложения, умеют работатаь по протоколу HTTP, то 
проблему поможет решить REST

REST (Representational State Transfer -  передача состояние представления) - введен Роем Филдингом(Roy Fielding)

REST - это общие принципы организация взаимодействия приложения/сайта с сервером посредством протокола HTTP

REST - это набор правил для написания веб-серверного приложения, чтобы другие системы обменивались данными

Серверное-приложение может сооответствовать либо не соответствовать правилам REST

RESTful сервис - сервис написанный с учетом всех ограничений(правил) REST


Существуте шесть обязательных ограничений для построения REST-приложения по Филдингу
- Модель клиент-сервер(Client-Server): система должна быть разделена на клиентов и на сервера;
- Отсутствие состояния(Stateless): сервер не должен хранить какой-либо информации о клиентах;
- Кэширование (Cache): каждый ответ должен быть отмечен является ли он кэшируемым или нет;
- Единый интерфейс (Unifrom Interface): определяет интерфейс между клиентами и серверами;
- Слои (Layers): в REST допускается разделить систему на иерархию слоев, но с условием, что каждый компонент 
  может видеть компоненты только следующего слоя;
- Код по требованию(Code on demand): В REST позволяется загрузка и выполнение кода или программы на стороне клиента.

API(Application Programming Interface) - это интерфейс взаимодействия между сайтом и сторонними программами и серверами.

Django REST framework (DRF) - мощный и гибкий инструмент для построения Web API

1. Крайне удобная для разработчиков браузерная версия API
2. Сериализация, поддерживающая ORM и не-ORM источники данных
3. Расширенная документация и отличная поддержка сообщества
4. Возможность полной и детальной настройки
5. Используется и пользуется уважением таких узнаваемых компаний, как Mozills, Red Hat, Heroku и т.д.

Требование:
- Python(3.5 >)
- Django(1.11 >)






"""

"""



"""

"""


"""

"""


"""
"""


"""
"""



"""

"""



"""

"""


"""

"""


"""
"""


"""