"""
День 4. Неделя 11. 5 января
Тема: Регистрация. Код Активации. Теория

Коды высылаются вам на определенный ресурс, который связывает ваш аккаунт с онлайн-ресурсом.При использовании высланного 
кода пользователь активирует свой аккаунт, тем самым подтверждая свою личность.

Код активации представляет набор каких-то симоволов или же цифр

Чтобы постоянно не запрашивать данные при переходе на разные urll-адреса, пользователь вводит данные один раз - логиньться(login)
- и взамен ему выдается ключ-токен, который будет использоваться до тех пор, пока пользователь не выйдет из своего аккаунта(logout)














"""
"""

"""


"""


"""
