"""
День 3. Неделя 9. 15 декабря
Тема: Работа с формами. Forms. Шаблонизаторы

HTML форма - это группа из одного или нескольких полей/виджетов на веб-странице, которая используется для сбора информации от пользователй.

Межсайтовая подделка запроса
( Cross Site Request Forgery - CSRF )

Класс Form - упрощает генерацию HTML-вормы и очистку/валидацию её данных.

На языке HTML форма описывается как набор элементов, расположенных внутри парных тэгов <form>...</form>

В фремворке Джанго шаблонизатором является Jinja

Возможности:
- Вывод стандартной HTML-разметки
- Проверка условий
- Вывод объектов через цикл
- Вывод переменных


"""