"""

ТЗ “Тетрис” 
Напишите мини-проект “Tetris”. Для этого, вам пригодится следующий стек знаний: основы языка Python (в особенности функции, включая встроенные), 
ООП, работа с файлами, настройка виртуального окружения. 
Для реализации проекта Tetris вы можете воспользоваться библиотеками (pygame, tkinter, random). 

Требования: 

1. Tetris должен содержать в себе минимум 4 фигурок разных цветов. При нажатии на верхнюю стрелку 
клавиш каждая фигурка меняет свое направление. Всего 4 направления у каждой фигурки. 

2. Фигурки появляются рандомно. Пока первая фигурка не займет свое место, 
следующая фигурка не появляется. При этом программа показывает следующую фигурку, 
которая стоит в очереди. 

3. Каждый раз, когда собирается один целый ряд, этот ряд исчезает и вам начисляется 10 очков. 
При этом любой собранный целый ряд может исчезнуть, не только самый нижний. 

4. Как только фигурка доходит до верхнего края игрового окна, программа завершается сообщением о том, 
что вы проиграли. 5. При этом наилучший результат сохраняется.

"""
